#+TITLE: anneKsiy's  Emacs Config
#+AUTHOR: Abdullah "anneKsiy" Adam

** Fonts

#+begin_src emacs-lisp
  (defvar abu/default-font-size 160)
  ;(set-face-attribute 'default nil :font "Source Code Pro" :height abu/default-font-size)
  (set-face-attribute 'default nil :font "Iosevka" :height abu/default-font-size)
  ;(set-face-attribute 'default nil :font "Ubuntu Mono derivative Powerline" :height abu/default-font-size)
  ;(set-face-attribute 'default nil :font "Fira Mono for Powerline" :height abu/default-font-size)

  ;; Set the fixed pitch face
  ;;(set-face-attribute 'fixed-pitch nil :font "Source Code Pro" :height 145)
  (set-face-attribute 'fixed-pitch nil :font "Iosevka" :height abu/default-font-size)
  ;(set-face-attribute 'fixed-pitch nil :font "Ubuntu Mono derivative Powerline" :height abu/default-font-size)
  ;(set-face-attribute 'fixed-pitch nil :font "Fira Mono for Powerline" :height abu/default-font-size)

  ;; Set the variable pitch face
  ;(set-face-attribute 'variable-pitch nil :font "Cantarell" :height 160 :weight 'regular)
  ;(set-face-attribute 'variable-pitch nil :font "Amazon Ember" :height 145 :weight 'regular)
  (set-face-attribute 'variable-pitch nil :font "Iosevka Aile" :height 160 :weight 'regular)
  ;(set-face-attribute 'fixed-pitch nil :font "Inconsolata" :height abu/default-font-size)

  ;; set frame font
  (add-to-list 'default-frame-alist '(font . "Iosevka"))
  ;(add-to-list 'default-frame-alist '(font "Inconsolata"))

(defun abu/configure-frame-font (frame)
  "Configure font given initial non-daemon FRAME.
Intended for `after-make-frame-functions'."
  ;; Do stuff with FRAME...
  (defvar abu/default-font-size 155)
  ;(set-face-attribute 'default nil :font "Source Code Pro" :height abu/default-font-size)
  (set-face-attribute 'default nil :font "Iosevka" :height abu/default-font-size)
  ;(set-face-attribute 'default nil :font "Ubuntu Mono derivative Powerline" :height abu/default-font-size)
  ;(set-face-attribute 'default nil :font "Fira Mono for Powerline" :height abu/default-font-size)

  ;; Set the fixed pitch face
  ;;(set-face-attribute 'fixed-pitch nil :font "Source Code Pro" :height 145)
  (set-face-attribute 'fixed-pitch nil :font "Iosevka" :height abu/default-font-size)
  ;(set-face-attribute 'fixed-pitch nil :font "Ubuntu Mono derivative Powerline" :height abu/default-font-size)
  ;(set-face-attribute 'fixed-pitch nil :font "Fira Mono for Powerline" :height abu/default-font-size)

  ;; Set the variable pitch face
  ;(set-face-attribute 'variable-pitch nil :font "Cantarell" :height 160 :weight 'regular)
  ;(set-face-attribute 'variable-pitch nil :font "Amazon Ember" :height 145 :weight 'regular)
  (set-face-attribute 'variable-pitch nil :font "Iosevka Aile" :height 160 :weight 'regular)
  ;(set-face-attribute 'fixed-pitch nil :font "Inconsolata" :height abu/default-font-size)

  ;; set frame font
  (add-to-list 'default-frame-alist '(font . "Iosevka"))
  (remove-hook 'after-make-frame-functions #'abu/configure-frame-font))

(add-hook 'after-make-frame-functions #'abu/configure-frame-font)

#+end_src

#+RESULTS:
| abu/configure-frame-font | evil-init-esc | select-frame |

* Org

#+begin_src emacs-lisp
(defun abu/org-mode-setup ()
  (org-indent-mode)
  (variable-pitch-mode 1)
  (visual-line-mode 1)
  (setq org-log-done 'time) ;; can change to 'note if you want to take notes when closing an item as well
  (setq org-src-preserve-indentation t)
  (setq org-custom-properties '("TICKET_LINK" "TICKET_TITLE"))
  (setq org-todo-keywords '((sequence "TODO" "PENDING" "DELEGATE" "TICKLER" "BLOCKED" "DONE")))
  (setq org-refile-targets '((nil . (:level . 2))))
  (setq org-todo-keyword-faces '(
                                 ("TODO" (:foreground "orange" :weight bold))
                                 ("PENDING" (:foreground "brown" :weight bold))
                                 ("TICKLER" (:foreground "red" :weight bold))
                                 ("BLOCKED" (:foreground "maroon" :weight bold))
                                 ("DELEGATE" (:foreground "blue" :weight bold)))))


;; Change the way org exports code blocks to markdown
(defun org-md-example-block (example-block _contents info)
  "Transcode EXAMPLE-BLOCK element into Markdown format.
CONTENTS is nil.  INFO is a plist used as a communication
channel."
  (concat "```\n"
          (org-remove-indentation
           (org-export-format-code-default example-block info))
          "```"))

(defun abu/org-font-setup ()
  (interactive)
  (font-lock-add-keywords 'org-mode
                          '(("^ *\\([-]\\) "
                             (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))
  (set-face-attribute 'org-document-title nil :font "Iosevka Aile" :weight 'bold :height 1.3)


  (dolist (face '((org-level-1 . 1.4)
                  (org-level-2 . 1.2)
                  (org-level-3 . 1.1)
                  (org-level-4 . 1.1)
                  (org-level-5 . 1.1)
                  (org-level-6 . 1.1)
                  (org-level-7 . 1.1)
                  (org-level-8 . 1.1)))
    (set-face-attribute (car face) nil :font "Iosevka Aile" :weight 'bold :height (cdr face)))

  ;; Ensure that anything that should be fixed-pitch in Org files appears that way
  (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))

(defun abu/org-mode-visual-fill ()
  (setq visual-fill-column-width 100
        visual-fill-column-center-text t
        visual-fill-column-enable-sensible-window-split t)
  (visual-fill-column-mode 0))

;;     (defun abu/org-mode-visual-fill ()
;;       (setq visual-fill-column-width 100
;;             visual-fill-column-center-text t)
;;       (visual-fill-column-mode 1))
;;   (add-hook 'Info-mode-hook (lambda () (set-face-attribute 'default nil :font "Cantarell" :height 
;;   (add-hook 'Info-mode-hook 'abu/org-mode-visual-fill)
;; 150 :weight 'regular)))

(use-package org-modern)
(use-package org
  :hook (org-mode . abu/org-mode-setup)
  (org-mode-hook . org-modern-mode)
  (org-agenda-finalize-hook . org-modern-agenda)
  :config
  (setq org-ellipsis " ▾")
  (abu/org-font-setup)
  (abu/org-mode-setup)
                                        ;(setq org-agenda-files '("~/Documents/OrgStuff/schedule.org"))
  (setq org-agenda-files '("/Users/adammabd/Documents/OrgStuff/roam/20230821103815-todo.org"))
  (setq org-highest-priority ?A
        org-lowest-priority ?E
        org-default-priority ?B)
  (setq org-capture-templates
        '(("t" "Todo" entry (file+headline "~/Documents/OrgStuff/roam/20230821103815-todo.org" "Work Todo List")
           "** %^{Todo type|TODO|PENDING|DELEGATE|TICKLER|BLOCKED} [#%^{Priority type|A|B|C|D}] %?\n:PROPERTIES:\n:CATEGORY: %^{Category type|Code|Admin|Ops|Study|CR|Side-projects|Doc|Home|Miata}\n:TICKET_LINK: %^{Ticket link}\n:TICKET_TITLE: %^{Ticket title}\n:END:"))))

(use-package org-bullets
  :after org
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

(use-package visual-fill-column
  :hook (org-mode . abu/org-mode-visual-fill)
  (Info-mode . abu/org-mode-visual-fill))
#+end_src

#+RESULTS:
| abu/org-mode-visual-fill | doom-modeline-set-info-modeline | (lambda nil (set (make-local-variable 'visual-fill-column-width) 90)) | (lambda nil (display-line-numbers-mode 0)) | turn-on-font-lock |

** Flycheck

#+begin_src emacs-lisp
(use-package flycheck
  :config
  (setq flycheck-check-syntax-automatically '(save idle-change mode-enabled))
  (global-flycheck-mode))
(flycheck-add-mode 'typescript-tslint 'web-mode)
#+end_src

#+RESULTS:
| web-mode | typescript-mode |

** JS2

#+begin_src  emacs-lisp
  (use-package js2-mode
    :hook
    ((js-mode-hook . js2-minor-mode)
     (js2-mode-hook . ac-js2-mode))
    :config
    (add-to-list 'auto-mode-alist '("\\.json$" . js-mode)))
#+end_src

#+RESULTS:
| ac-js2-mode |

** Tide

#+begin_src emacs-lisp
  (use-package tide)
  (defun setup-tide-mode ()
    (interactive)
    (tide-setup)
    (flycheck-mode +1)
    (setq flycheck-check-syntax-automatically '(save idle-change mode-enabled))
    (eldoc-mode +1)
    (tide-hl-identifier-mode +1)
    )
  ;;(add-hook 'before-save-hook 'tide-format-before-save)
  (add-hook 'typescript-mode-hook #'setup-tide-mode)
#+end_src

#+RESULTS:
| setup-tide-mode | evil-collection-typescript-mode-set-evil-shift-width | lsp |

** Typescript

#+begin_src emacs-lisp
  (use-package typescript-mode
    :hook ((typescript-mode . lsp-deferred)
  (typescript-mode . setup-tide-mode))
    :config
    (setq typescript-indent-level 2))
(lsp-make-interactive-code-action organize-imports "source.organizeImports.ts-ls")
#+end_src

#+RESULTS:
| lsp-deferred | setup-tide-mode | evil-collection-typescript-mode-set-evil-shift-width | lsp |

** Jest

#+begin_src emacs-lisp
(use-package jest-test-mode 
  :ensure t 
  :commands jest-test-mode
  :hook (typescript-mode js-mode typescript-tsx-mode))
  #+end_src

  #+RESULTS:
  | jest-test-mode |

** Web Mode & Emmet Mode
Found the following at https://willschenk.com/articles/2021/setting_up_emacs_for_typescript_development/

#+begin_src emacs-lisp
  (use-package emmet-mode
    :config (setq emmet-move-cursor-between-quotes t))
  (defun abu/web-mode-init ()
    "Hooks for web mode. Adjust indent"
    (setq web-mode-markup-indent-offset 2)
    (setq web-mode-code-indent-offset 2)
    (setq tide-format-options '(:tabSize 2 :indentSize 2)))

  (use-package web-mode
    :hook ((web-mode . abu/web-mode-init))
    :init (add-to-list 'auto-mode-alist '("\\.tsx\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.html$" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.css?'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.js\\'" . web-mode)))
  (add-hook 'web-mode-hook
            (lambda ()
              (when (string-equal "tsx" (file-name-extension buffer-file-name))
                (setup-tide-mode))))
  (add-hook 'web-mode-hook 'emmet-mode)

  ;; enable typescript-tslint checker
  (flycheck-add-mode 'typescript-tslint 'web-mode)
#+end_src

#+RESULTS:
| web-mode | web-mode | typescript-mode |


** Prettier

#+begin_src emacs-lisp
    (use-package prettier-js)
    (add-hook 'js2-mode-hook 'prettier-js-mode)
    (add-hook 'js-mode-hook 'prettier-js-mode)
    (remove-hook 'js-mode-hook 'prettier-js-mode)
    (add-hook 'web-mode-hook 'prettier-js-mode)
    (setq prettier-js-args '(
    "--trailing-comma" "es5"
    "--bracket-spacing" "true"
    "--print-width" "120"
    "--tab-width" "2"
  ))
#+end_src

#+RESULTS:
| --trailing-comma | es5 | --bracket-spacing | true | --tab-width | 4 |

** Go

#+begin_src emacs-lisp
(use-package go-mode
  :hook (go-mode-hook . lsp-deferred))
#+end_src

#+RESULTS:
| lsp-deferred | evil-collection-ruby-mode-set-evil-shift-width | doom-modeline-env-setup-ruby |

** Org Agenda customizations

#+begin_src emacs-lisp
;; (setq org-agenda-custom-commands
;;       '(("n" "Agenda and all TODOs"
;;          ((agenda "")
;;           (alltodo "")))))

;; (setq org-agenda-custom-commands
;;       '(
;;         ("D" "Demo block agenda"
;;          ((todo "PENDING"
;;                 ((org-agenda-overriding-header "⏳ Pending Tasks")))
;;           (agenda ""
;;                   (
;;                    ;;(org-agenda-block-separator ?+)
;;                    (org-agenda-span 'day)
;;                    (org-deadline-warning-days 3)
;;                    (org-agenda-day-face-function (lambda (date) 'org-agenda-date))
;;                    (org-agenda-fontify-priorities t)
;;                    (org-agenda-overriding-header "\n📖 Daily Agenda\n")))))
;;         ))


;; This is the expanded view of my code (which is further below):
(setq org-agenda-custom-commands
      `(("A" "Daily agenda and top priority tasks"
         ((tags-todo "*"
                     ((org-agenda-skip-function '(org-agenda-skip-if nil '(timestamp)))
                      (org-agenda-skip-function
                       `(org-agenda-skip-entry-if
                         'notregexp ,(format "\\[#%s\\]" (char-to-string org-priority-highest))))
                      (org-agenda-block-separator nil)
                      (org-agenda-overriding-header "Important tasks without a date\n")))
          (agenda "" ((org-agenda-span 1)
                      (org-deadline-warning-days 0)
                      (org-agenda-block-separator nil)
                      (org-scheduled-past-days 0)
                      ;; We don't need the `org-agenda-date-today'
                      ;; highlight because that only has a practical
                      ;; utility in multi-day views.
                      (org-agenda-day-face-function (lambda (date) 'org-agenda-date))
                      (org-agenda-format-date "%A %-e %B %Y")
                      (org-agenda-overriding-header "\nToday's agenda\n")))
          (agenda "" ((org-agenda-start-on-weekday nil)
                      (org-agenda-start-day "+1d")
                      (org-agenda-span 3)
                      (org-deadline-warning-days 0)
                      (org-agenda-block-separator nil)
                      (org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                      (org-agenda-overriding-header "\nNext three days\n")))
          (agenda "" ((org-agenda-time-grid nil)
                      (org-agenda-start-on-weekday nil)
                      ;; We don't want to replicate the previous section's
                      ;; three days, so we start counting from the day after.
                      (org-agenda-start-day "+4d")
                      (org-agenda-span 14)
                      (org-agenda-show-all-dates nil)
                      (org-deadline-warning-days 0)
                      (org-agenda-block-separator nil)
                      (org-agenda-entry-types '(:deadline))
                      (org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                      (org-agenda-overriding-header "\nUpcoming deadlines (+14d)\n")))))
        ("P" "Plain text daily agenda and top priorities"
         ((tags-todo "*"
                     ((org-agenda-skip-function '(org-agenda-skip-if nil '(timestamp)))
                      (org-agenda-skip-function
                       `(org-agenda-skip-entry-if
                         'notregexp ,(format "\\[#%s\\]" (char-to-string org-priority-highest))))
                      (org-agenda-block-separator nil)
                      (org-agenda-overriding-header "Important tasks without a date\n")))
          (agenda "" ((org-agenda-span 1)
                      (org-deadline-warning-days 0)
                      (org-agenda-block-separator nil)
                      (org-scheduled-past-days 0)
                      ;; We don't need the `org-agenda-date-today'
                      ;; highlight because that only has a practical
                      ;; utility in multi-day views.
                      (org-agenda-day-face-function (lambda (date) 'org-agenda-date))
                      (org-agenda-format-date "%A %-e %B %Y")
                      (org-agenda-overriding-header "\nToday's agenda\n")))
          (agenda "" ((org-agenda-start-on-weekday nil)
                      (org-agenda-start-day "+1d")
                      (org-agenda-span 3)
                      (org-deadline-warning-days 0)
                      (org-agenda-block-separator nil)
                      (org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                      (org-agenda-overriding-header "\nNext three days\n")))
          (agenda "" ((org-agenda-time-grid nil)
                      (org-agenda-start-on-weekday nil)
                      ;; We don't want to replicate the previous section's
                      ;; three days, so we start counting from the day after.
                      (org-agenda-start-day "+4d")
                      (org-agenda-span 14)
                      (org-agenda-show-all-dates nil)
                      (org-deadline-warning-days 0)
                      (org-agenda-block-separator nil)
                      (org-agenda-entry-types '(:deadline))
                      (org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                      (org-agenda-overriding-header "\nUpcoming deadlines (+14d)\n"))))
         ((org-agenda-with-colors nil)
          (org-agenda-prefix-format "%t %s")
          (org-agenda-current-time-string ,(car (last org-agenda-time-grid)))
          (org-agenda-fontify-priorities nil)
          (org-agenda-remove-tags t))
         ("agenda.txt"))))



;; And this is what I actually use.  The `defvar' is stored in my
;; prot-org.el file.  In the video I explain why I use this style.

(defvar prot-org-custom-daily-agenda
  ;; NOTE 2021-12-08: Specifying a match like the following does not
  ;; work.
  ;;
  ;; tags-todo "+PRIORITY=\"A\""
  ;;
  ;; So we match everything and then skip entries with
  ;; `org-agenda-skip-function'.
  `((tags-todo "*"
               ((org-agenda-skip-function '(org-agenda-skip-if nil '(timestamp)))
                (org-agenda-skip-function
                 `(org-agenda-skip-entry-if
                   'notregexp ,(format "\\[#%s\\]" (char-to-string org-priority-highest))))
                (org-agenda-block-separator nil)
                (org-agenda-overriding-header "Important tasks without a date\n")))
    (agenda "" ((org-agenda-span 1)
                (org-deadline-warning-days 0)
                (org-agenda-block-separator nil)
                (org-scheduled-past-days 0)
                ;; We don't need the `org-agenda-date-today'
                ;; highlight because that only has a practical
                ;; utility in multi-day views.
                (org-agenda-day-face-function (lambda (date) 'org-agenda-date))
                (org-agenda-format-date "%A %-e %B %Y")
                (org-agenda-overriding-header "\nToday's agenda\n")))
    (agenda "" ((org-agenda-start-on-weekday nil)
                (org-agenda-start-day "+1d")
                (org-agenda-span 3)
                (org-deadline-warning-days 0)
                (org-agenda-block-separator nil)
                (org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                (org-agenda-overriding-header "\nNext three days\n")))
    (agenda "" ((org-agenda-time-grid nil)
                (org-agenda-start-on-weekday nil)
                ;; We don't want to replicate the previous section's
                ;; three days, so we start counting from the day after.
                (org-agenda-start-day "+4d")
                (org-agenda-span 14)
                (org-agenda-show-all-dates nil)
                (org-deadline-warning-days 0)
                (org-agenda-block-separator nil)
                (org-agenda-entry-types '(:deadline))
                (org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                (org-agenda-overriding-header "\nUpcoming deadlines (+14d)\n"))))
  "Custom agenda for use in `org-agenda-custom-commands'.")

(setq org-agenda-custom-commands
      `(("A" "Daily agenda and top priority tasks"
         ,prot-org-custom-daily-agenda)
        ("P" "Plain text daily agenda and top priorities"
         ,prot-org-custom-daily-agenda
         ((org-agenda-with-colors nil)
          (org-agenda-prefix-format "%t %s")
          (org-agenda-current-time-string ,(car (last org-agenda-time-grid)))
          (org-agenda-fontify-priorities nil)
          (org-agenda-remove-tags t))
         ("agenda.txt"))))
#+end_src


ORG LATEX
#+begin_src emacs-lisp
;; https://emacs.stackexchange.com/questions/33010/how-to-word-wrap-within-code-blocks
(setq org-latex-listings t)  ;; Ensure LaTeX listings is enabled

;; Custom LaTeX options for source blocks
(setq org-latex-packages-alist
      '(("latex" "listings" nil)))  ;; Ensure the listings package is loaded

(setq org-latex-default-packages-alist
      (append org-latex-default-packages-alist
              '(("listings" "utf8" nil))))  ;; Add listings package support

(setq org-latex-src-block-backend 'minted)
(setq org-latex-minted-options '(("breaklines" "true")
                                 ("frame" "single")   ;; Adds a frame around code blocks (optional)
                                 ("fontsize" "\\small") ;; Change the font size of code blocks
                                 ("linenos" "true")   ;; Add line numbers to code blocks (optional)
                                 ("fontfamily" "pcr")
                                 ("breakanywhere" "true")))
(setq org-latex-header-extra
      '("\\renewcommand{\\ttdefault}{pcr}"))
(setq org-latex-listings-options
      '(("basicstyle" "\\pcr")  ;; Set the font style to typewriter
        ("numbers" "left")           ;; Show line numbers on the left (optional)
        ("frame" "single")))         ;; Add a frame around code blocks (optional)
#+end_src

#+RESULTS:
| basicstyle | \pcr   |
| numbers    | left   |
| frame      | single |


* Tramp remote ssh

#+begin_src emacs-lisp
(message "HELLO TRAMP SSH!!!")
(customize-set-variable
 'tramp-ssh-controlmaster-options "-o ControlMaster=auto -o ControlPath='tramp.%%C' -o ControlPersist=yes")
#+end_src

#+RESULTS:
: -o ControlMaster=auto -o ControlPath='tramp.%%C' -o ControlPersist=yes


* General Tweaks

#+begin_src emacs-lisp
  ;; set timezone
  (setenv "TZ" "Africa/Harare")
  (use-package exec-path-from-shell
     :config (exec-path-from-shell-initialize))
  (setq scroll-margin 8)
  (setq scroll-conservatively 101)
  (setq scroll-step 1)
  (setq visual-bell t)
  (menu-bar-mode -1)
  (setq ring-bell-function 'ignore)
  (setq markdown-max-image-size '(450 . 450))
  (setq toggle-truncate-lines 1)
  (electric-pair-mode 1)
  (blink-cursor-mode -1)
  (global-diff-hl-mode 1)
  (global-set-key [S-wheel-right] 'scroll-left)
  (global-set-key [S-wheel-left] 'scroll-right)
  (add-to-list 'exec-path "/Users/adammabd/.local/bin/q")
  (add-to-list 'exec-path "~/Documents/kotlin-language-server/server/build/install/server/bin")
  (add-to-list 'exec-path "~/Documents/kotlin-debug-adapter/adapter/build/install/adapter/bin")
  (add-to-list 'exec-path "~/Documents/kotlin-debug-adapter/adapter/build/install/adapter/bin")
  (add-to-list 'exec-path "/Users/adammabd/.rbenv/shims/solargraph")

  (add-to-list 'exec-path "$HOME/.cargo/env")
  (setq exec-path (append exec-path '("/Users/adammabd/.nvm/versions/node/v17.2.0/bin")))
  (setq warning-suppress-types '(yasnippet backquote-change))
#+end_src

#+RESULTS:
| yasnippet | backquote-change |

** Info mode tweaks

#+begin_src emacs-lisp
(add-hook 'Info-mode-hook
          (lambda () (set (make-local-variable 'visual-fill-column-width) 90)))
;(push "/Users/adammabd/Downloads/sicp.info" Info-additional-directory-list)
;(push "/usr/local/share/info/emacs" Info-additional-directory-list)
;(push "/usr/local/share/info" Info-additional-directory-list)
#+end_src

#+RESULTS:
| /Users/adammabd/Downloads/sicp.info | /Users/adammabd/Downloads/sicp.info |

